[
  {
    "id": 1,
    "date": "Ongoing (July 2025)",
    "title": "This website",
    "description": "The website you are currently viewing was created using Vue.js and Tailwind CSS.  It is still being updated.",
    "link": "https://github.com/retupmoc258/retupmoc258.github.io",
    "download": false,
    "tags": ["Vue", "Tailwind CSS", "JavaScript", "HTML", "CSS", "IntelliJ IDEA"]
  },
  {
    "id": 99,
    "date": "July 2025",
    "title": "Go website listener",
    "description": "I recently learned Go and started a project that will watch a website for changes. When a change was made, it will send an email to a list of subscribers.  The project is still in development and does not have complete features. This project was developed for a company I contract for, so the code is private, but I\"m happy to discuss the project with you.",
    "link": "",
    "download": false,
    "tags": ["Go", "Web service", "Hashing", "Api", "Visual Studio Code"]
  },
  {
    "id": 100,
    "date": "July 2025",
    "title": "Contact Form API with Express and Mailgun",
    "description": "I created an API endpoint that would accept a contact form submission and send an email to the person who filled out the form and the company hosting the website. This project uses Express with Node.js and a Mailgun module to send the email. This project was developed for a company I contract for, so the code is private, but I\"m happy to discuss the project with you.",
    "link": "",
    "download": false,
    "tags": ["Express", "Node.js", "Mailgun", "Api", "JOI", "IntelliJ IDEA"]
  },
  {
    "id": 101,
    "date": "June 2025",
    "title": "Vue Crash Course project (by Brad Traversy)",
    "description": "This was an application I made based on Brad Traversy\"s \"Vue Crash Course\" YouTube video.  Project is free to use.  More information about the video can be found in the README.md file",
    "link": "https://github.com/retupmoc258/vue-project",
    "download": false,
    "tags": ["Vue", "Tailwind CSS", "Visual Studio Code"]
  },
  {
    "id": 102,
    "date": "July 2025",
    "title": "Software Engineering Capstone (Vacation Planner mobile application v 1.0.1)",
    "description": "This was my capstone project for software engineering.  I created a mobile application that allows a user to track vacation information. The application was designed for Android and uses Java as its programming language.  It also uses the Room framework to use the underlying database structures securely.  The application is available to use for free, if desired, but may not be copied, redistributed, or modified. Any use of this software for gain (including submitting for a job or school course) is prohibited.",
    "link": "/files/vacation_planner_1.0.1.apk",
    "download": true,
    "tags": ["Android", "Java", "Room Framework", "SQLite", "SQL",  "Android Studio"]
  },
  {
    "id": 103,
    "date": "Approx. March 2025",
    "title": "Java Fullstack Inventory Application",
    "description": "This was a school project for Java Frameworks.  The application was designed to allow a user to manage an inventory of items. The application was designed for Java and uses the Spring Framework to create the backend. The link will take you to my repository, where you may download the source code.  Full instructions are in the README.txt file.",
    "link": "https://github.com/retupmoc258/Java-Fullstack-Inventory-Application",
    "download": false,
    "tags": ["Java", "Spring", "IntelliJ IDEA", "API"]
  },
  {
    "id": 105,
    "date": "Approx. February 2025",
    "title": "User Interface Design project (Taniti)",
    "description": "This project was to create a user interface design that would be friendly for a user. This project was designed for a mobile device, and the age will simulate the view on a mobile device. I created the interface, but I did not program the HTML elements.  This project uses Justinmind.",
    "link": "taniti/index.html",
    "download": false,
    "tags": ["Justinmind", "Design"]
  },
  {
    "id": 104,
    "date": "Approx. October 2024",
    "title": "\"World Map\" Angular Project with World Bank API",
    "description": "This school project focuses on using the Angular framework to create a basic web application. A world map is displayed and when you click on a country, it uses the World Bank API to retrieve information about that country and display it on the web page.  The repository is private to prevent students from copying the code. If you would like to see the repository code or test the application, please email me.",
    "link": "",
    "download": false,
    "tags": ["Angular", "TypeScript", "API"]
  }
]